0_batch/requests/departments.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://kp.com/ws">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getDepartmentsRequest>
         <gs:departmentName>N-a-m-e-01</gs:departmentName>
      </gs:getDepartmentsRequest>
   </soapenv:Body>
</soapenv:Envelope>